# MAC 한글 설정
par(family = "NanumGothic")

install.packages("interactions")

library(dplyr)
library(interactions)
library(ggplot2)

# 내장 데이터셋 불러오기
data("LifeCycleSavings")

df <- LifeCycleSavings %>%
  rename(
    저축률 = sr,
    가처분소득 = dpi,
    실질소득증가율 = ddpi,
    젊은층비율 = pop15,
    노년층비율 = pop75
  )


# 회귀모델: 저축률 = 젊은층 + 성장률 + 상호작용
model_pop15 <- lm(저축률 ~ 젊은층비율 * 실질소득증가율, data = df)
summary(model_pop15)


# 조절효과 시각화 1 
# 젊은층 비율(pop15)이 많을수록, 성장률(ddpi)의 효과가 어떻게 달라지는가?


plot_pop15 <- interact_plot(
  model_pop15,
  pred = 젊은층비율,          # X축(주효과)
  modx = 실질소득증가율,      # 조절변수
  plot.points = FALSE,
  interval = TRUE
) +
  labs(
    title = "젊은층 비율 × 성장률이 저축률에 미치는 조절 효과",
    x = "젊은층 비율(%)",
    y = "저축률",
    color = "실질소득 증가율(성장률)"
  ) +
  theme_bw(base_size = 10) 

plot_pop15



# 모델 2: pop75 조절
model_pop75 <- lm(저축률 ~ 노년층비율 * 실질소득증가율, data = df)
summary(model_pop75)

# 조절효과 시각화 2
# 노년층(pop75)의 비율이 높을 때 성장률이 저축률에 미치는 효과는?

plot_pop75 <- interact_plot(
  model_pop75,
  pred = 노년층비율,
  modx = 실질소득증가율,
  plot.points = FALSE,
  interval = TRUE
) +
  labs(
    title = "노년층 비율 × 성장률이 저축률에 미치는 조절 효과",
    x = "노년층 비율(%)",
    y = "저축률",
    color = "실질소득 증가율(성장률)"
  ) +
  theme_bw(base_size = 10)

plot_pop75

'
-1 SD: 평균보다 경제성장률이 낮은 나라
Mean: 보통 수준
+1 SD: 평균보다 경제성장률이 높은 나라

이렇게 3가지 그룹에서
"젊은층 비율이 저축률에 어떻게 영향을 미치는지" 비교

'

"
👉 기울기가 크다 = 영향력이 크다
👉 기울기가 작다(평평하다) = 영향력이 약하다

선이 가파르게 아래로 내려가면 → 젊은층비율이 증가할수록 저축률이 크게 감소
선이 거의 수평이면 → 젊은층비율이 증가해도 저축률은 거의 변하지 않음


✔ 패턴 1. 성장률 낮은 국가(-1 SD)

선이 가장 가파르게 아래로 내려감
→ 젊은층이 많아지면 저축률이 크게 떨어짐

✔ 패턴 2. 성장률 평균인 국가

기울기 중간
→ 영향은 있지만 약해짐

✔ 패턴 3. 성장률 높은 국가(+1 SD)

선이 가장 완만함, 거의 수평
→ 젊은층이 증가해도 저축률이 거의 안 떨어짐
→ 즉, 성장률이 높으면 젊은층 증가의 부정적 영향이 약해짐
"


### 결과 : 젊은층 비율이 저축률을 낮추는 효과는 성장률이 높은 나라일수록 약해진다.







